homework_files/lesson_2/wrk_wsgi_test.log
ruslan@MacBook-Pro-Ruslan nginx %  wrk -t12 -c400 -d30s http://localhost:8000
Running 30s test @ http://localhost:8000
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    33.10ms   55.40ms 556.00ms   97.42%
    Req/Sec   235.38    164.10   700.00     57.52%
  16674 requests in 30.10s, 2.48MB read
  Socket errors: connect 112, read 17748, write 19, timeout 0
Requests/sec:    553.97
Transfer/sec:     84.39KB